Music_App/app/views/albums/edit.html.erb

SELECT "bands".* FROM "bands"
---
      <option disabled value="">--Please choose a band--</option>
      <% Band.all.each do |band| %>