Music_App/app/views/albums/new.html.erb

      <option disabled value="">--Please choose a band--</option>
      <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"