Music_App/app/views/albums/show.html.erb

<h1>Year: <%= current_album.year %> </h1>
<h1>Band: <%= Band.find_by(id: current_album.band_id).name %> </h1>
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]