Music_App/app/controllers/albums_controller.rb

INSERT INTO "albums" ("title", "year", "band_id", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Whatever"], ["year", 1234], ["band_id", 1], ["live", true], ["created_at", "2018-09-13 23:09:46.391904"], ["updated_at", "2018-09-13 23:09:46.391904"]]
---
  def create
    album = Album.new(album_params)
    if album.save!