Music_App/app/controllers/application_controller.rb

  def current_band
    @current_band = Band.find_by(id: params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def current_album
    @current_album = Album.find_by(id: params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]