Music_App/app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    band = Band.find_by(id: params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 2]]
---
  def destroy
    band = Band.find_by(id: params[:id])
    band.destroy

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Missy Elliot"], ["updated_at", "2018-09-13 21:56:54.679761"], ["id", 3]]
---
  def update
    band = Band.find_by(id: params[:id])
    if band.update(band_params)