Music_App/app/views/bands/index.html.erb

SELECT "bands".* FROM "bands"
---
<ul>
  <% Band.all.each do |band| %>